app/Controllers/AuthGoogle.php

SELECT *
FROM `user`
LEFT JOIN `info_peserta` ON `user`.`id`=`info_peserta`.`userId`
WHERE `email` = 'firdaunsilah1206@gmail.com'
---
    public function index()
    {
        $client = new Google_Client();
        $clientId = '235798189288-7s5aq32v09n5se3s0cjibdaa07qt1lk5.apps.googleusercontent.com';
        $clientSecret = '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';
        $redirectUri = base_url('login');

        $client->setClientId($clientId);
        $client->setClientSecret($clientSecret);
        $client->setRedirectUri($redirectUri);
        $client->addScope('profile');
        $client->addScope('email');

        if (isset($_GET['code'])) {
            $token = $client->fetchAccessTokenWithAuthCode($_GET['code']);
            $client->setAccessToken($token['access_token']);
            $service = new Google_Service_Oauth2($client);
        } else {
            return redirect()->to($client->createAuthUrl());
        }
        $respond = [
            'name' => $service->userinfo->get()->getName(),
            'email' => $service->userinfo->get()->getEmail(),
            'regist' => TRUE
        ];