app/Controllers/Home.php

    public function index()
    {
        $userModel = new UserModel();
        $user = $userModel->join('info_peserta', 'user.id=info_peserta.userId')->where('info_peserta.endDate>', date('Y-m-d'))->get()->getResultArray();
---
SELECT *
FROM `user`
JOIN `info_peserta` ON `user`.`id`=`info_peserta`.`userId`
WHERE `info_peserta`.`endDate` > '2022-10-31'

    public function getUser()
    {
        $userModel = new UserModel();
        $peserta = $userModel->join('info_peserta', 'user.id=info_peserta.userId')->where('status', 2)->where('info_peserta.endDate>', date('Y-m-d'))->countAllResults();
        $all = $userModel->join('info_peserta', 'user.id=info_peserta.userId')->where('info_peserta.endDate>', date('Y-m-d'))->get()->getResultArray();
        $pendaftar = $userModel->join('info_peserta', 'user.id=info_peserta.userId')->where('status', 0)->where('info_peserta.endDate>', date('Y-m-d'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`
JOIN `info_peserta` ON `user`.`id`=`info_peserta`.`userId`
WHERE `status` = 2
AND `info_peserta`.`endDate` > '2022-11-02'
SELECT *
FROM `user`
JOIN `info_peserta` ON `user`.`id`=`info_peserta`.`userId`
WHERE `info_peserta`.`endDate` > '2022-11-02'
SELECT COUNT(*) AS `numrows`
FROM `user`
JOIN `info_peserta` ON `user`.`id`=`info_peserta`.`userId`
WHERE `status` = 0
AND `info_peserta`.`endDate` > '2022-11-02'